FreeRTOS/FreeRTOS/FreeRTOS/Demo/Cygnal/c8051f120.h
/*  Page 0x02 */
sfr at 0x88 CPT1CN; /* COMPARATOR 1 CONTROL                          */
sfr at 0x89 CPT1MD; /* COMPARATOR 1 CONFIGURATION                    */
sfr at 0xBA AMX2CF; /* ADC 2 MUX CONFIGURATION                       */
sfr at 0xBB AMX2SL; /* ADC 2 MUX CHANNEL SELECTION                   */
sfr at 0xBC ADC2CF; /* ADC 2 CONFIGURATION                           */
sfr at 0xBE ADC2;   /* ADC 2 DATA                                    */
sfr at 0xC4 ADC2GT; /* ADC 2 GREATER-THAN REGISTER                   */
sfr at 0xC6 ADC2LT; /* ADC 2 LESS-THAN REGISTER                      */
sfr at 0xC8 TMR4CN; /* TIMER 4 CONTROL                               */
sfr at 0xC9 TMR4CF; /* TIMER 4 CONFIGURATION                         */
sfr at 0xCA RCAP4L; /* TIMER 4 CAPTURE REGISTER - LOW BYTE           */
sfr at 0xCB RCAP4H; /* TIMER 4 CAPTURE REGISTER - HIGH BYTE          */
sfr at 0xCC TMR4L;  /* TIMER 4 - LOW BYTE                            */
sfr at 0xCD TMR4H;  /* TIMER 4 - HIGH BYTE                           */

/*  Page 0x02 */
sfr at 0x91 MAC0BL;   /* MAC0 B Register Low Byte                      */
sfr at 0x92 MAC0BH;   /* MAC0 B Register High Byte                     */
sfr at 0x93 MAC0ACC0; /* MAC0 Accumulator Byte 0 (LSB)                 */
sfr at 0x94 MAC0ACC1; /* MAC0 Accumulator Byte 1                       */
sfr at 0x95 MAC0ACC2; /* MAC0 Accumulator Byte 2                       */
sfr at 0x96 MAC0ACC3; /* MAC0 Accumulator Byte 3 (MSB)                 */
sfr at 0x97 MAC0OVR;  /* MAC0 Accumulator Overflow                     */
sfr at 0xC0 MAC0STA;  /* MAC0 Status Register                          */
sfr at 0xC1 MAC0AL;   /* MAC0 A Register Low Byte                      */
sfr at 0xC2 MAC0AH;   /* MAC0 A Register High Byte                     */
sfr at 0xC3 MAC0CF;   /* MAC0 Configuration                            */
sfr at 0xCE MAC0RNDL; /* MAC0 Rounding Register Low Byte               */
sfr at 0xCF MAC0RNDH; /* MAC0 Rounding Register High Byte              */

/*  Page 0x0F */
sfr at 0x88 FLSTAT;  /* FLASH STATUS                                  */
sfr at 0x89 PLL0CN;  /* PLL 0 CONTROL                                 */
sfr at 0x8A OSCICN;  /* INTERNAL OSCILLATOR CONTROL                   */
sfr at 0x8B OSCICL;  /* INTERNAL OSCILLATOR CALIBRATION               */
sfr at 0x8C OSCXCN;  /* EXTERNAL OSCILLATOR CONTROL                   */
sfr at 0x8D PLL0DIV; /* PLL 0 DIVIDER                                 */
sfr at 0x8E PLL0MUL; /* PLL 0 MULTIPLIER                              */
sfr at 0x8F PLL0FLT; /* PLL 0 FILTER                                  */
sfr at 0x96 SFRPGCN; /* SFR PAGE CONTROL                              */
sfr at 0x97 CLKSEL;  /* SYSTEM CLOCK SELECT                           */
sfr at 0x9A CCH0MA;  /* CACHE MISS ACCUMULATOR                        */
sfr at 0x9C P4MDOUT; /* PORT 4 OUTPUT MODE                            */
sfr at 0x9D P5MDOUT; /* PORT 5 OUTPUT MODE                            */
sfr at 0x9E P6MDOUT; /* PORT 6 OUTPUT MODE                            */
sfr at 0x9F P7MDOUT; /* PORT 7 OUTPUT MODE                            */
sfr at 0xA1 CCH0CN;  /* CACHE CONTROL                                 */
sfr at 0xA2 CCH0TN;  /* CACHE TUNING REGISTER                         */
sfr at 0xA3 CCH0LC;  /* CACHE LOCK                                    */
sfr at 0xA4 P0MDOUT; /* PORT 0 OUTPUT MODE                            */
sfr at 0xA5 P1MDOUT; /* PORT 1 OUTPUT MODE                            */
sfr at 0xA6 P2MDOUT; /* PORT 2 OUTPUT MODE CONFIGURATION              */
sfr at 0xA7 P3MDOUT; /* PORT 3 OUTPUT MODE CONFIGURATION              */
sfr at 0xAD P1MDIN;  /* PORT 1 INPUT MODE                             */
sfr at 0xB7 FLACL;   /* FLASH ACCESS LIMIT                            */
sfr at 0xC8 P4;      /* PORT 4                                        */
sfr at 0xD8 P5;      /* PORT 5                                        */
sfr at 0xE1 XBR0;    /* CROSSBAR CONFIGURATION REGISTER 0             */
sfr at 0xE2 XBR1;    /* CROSSBAR CONFIGURATION REGISTER 1             */
sfr at 0xE3 XBR2;    /* CROSSBAR CONFIGURATION REGISTER 2             */
sfr at 0xE8 ADC2CN;  /* ADC 2 CONTROL                                 */
sfr at 0xE8 P6;      /* PORT 6                                        */
sfr at 0xF8 P7;      /* PORT 7                                        */


/*  BIT Registers  */

/*  P0  0x80 */
sbit at 0x80 P0_0;
sbit at 0x81 P0_1;
sbit at 0x82 P0_2;
sbit at 0x83 P0_3;
sbit at 0x84 P0_4;
sbit at 0x85 P0_5;
sbit at 0x86 P0_6;
sbit at 0x87 P0_7;

/*  TCON  0x88 */
sbit at 0x88 IT0; /* EXT. INTERRUPT 0 TYPE                         */
sbit at 0x89 IE0; /* EXT. INTERRUPT 0 EDGE FLAG                    */
sbit at 0x8A IT1; /* EXT. INTERRUPT 1 TYPE                         */
sbit at 0x8B IE1; /* EXT. INTERRUPT 1 EDGE FLAG                    */
sbit at 0x8C TR0; /* TIMER 0 ON/OFF CONTROL                        */
sbit at 0x8D TF0; /* TIMER 0 OVERFLOW FLAG                         */
sbit at 0x8E TR1; /* TIMER 1 ON/OFF CONTROL                        */
sbit at 0x8F TF1; /* TIMER 1 OVERFLOW FLAG                         */

/*  CPT0CN  0x88 */
sbit at 0x88 CP0HYN0; /* COMPARATOR 0 NEGATIVE HYSTERESIS 0            */
sbit at 0x89 CP0HYN1; /* COMPARATOR 0 NEGATIVE HYSTERESIS 1            */
sbit at 0x8A CP0HYP0; /* COMPARATOR 0 POSITIVE HYSTERESIS 0            */
sbit at 0x8B CP0HYP1; /* COMPARATOR 0 POSITIVE HYSTERESIS 1            */
sbit at 0x8C CP0FIF;  /* COMPARATOR 0 FALLING EDGE INTERRUPT           */
sbit at 0x8D CP0RIF;  /* COMPARATOR 0 RISING EDGE INTERRUPT            */
sbit at 0x8E CP0OUT;  /* COMPARATOR 0 OUTPUT                           */
sbit at 0x8F CP0EN;   /* COMPARATOR 0 ENABLE                           */

/*  CPT1CN  0x88 */
sbit at 0x88 CP1HYN0; /* COMPARATOR 1 NEGATIVE HYSTERESIS 0            */
sbit at 0x89 CP1HYN1; /* COMPARATOR 1 NEGATIVE HYSTERESIS 1            */
sbit at 0x8A CP1HYP0; /* COMPARATOR 1 POSITIVE HYSTERESIS 0            */
sbit at 0x8B CP1HYP1; /* COMPARATOR 1 POSITIVE HYSTERESIS 1            */
sbit at 0x8C CP1FIF;  /* COMPARATOR 1 FALLING EDGE INTERRUPT           */
sbit at 0x8D CP1RIF;  /* COMPARATOR 1 RISING EDGE INTERRUPT            */
sbit at 0x8E CP1OUT;  /* COMPARATOR 1 OUTPUT                           */
sbit at 0x8F CP1EN;   /* COMPARATOR 1 ENABLE                           */

