FreeRTOS/FreeRTOS/FreeRTOS/Demo/Cygnal/c8051f120.h
/*  P6  0xE8 */
sbit at 0xE8 P6_0;
sbit at 0xE9 P6_1;
sbit at 0xEA P6_2;
sbit at 0xEB P6_3;
sbit at 0xEC P6_4;
sbit at 0xED P6_5;
sbit at 0xEE P6_6;
sbit at 0xEF P6_7;

/* SPI0CN F8H */
sbit at 0xF8 SPIEN;  /* SPI 0 SPI ENABLE                              */
sbit at 0xF9 TXBMT;  /* SPI 0 TX BUFFER EMPTY FLAG                    */
sbit at 0xFA NSSMD0; /* SPI 0 SLAVE SELECT MODE 0                     */
sbit at 0xFB NSSMD1; /* SPI 0 SLAVE SELECT MODE 1                     */
sbit at 0xFC RXOVRN; /* SPI 0 RX OVERRUN FLAG                         */
sbit at 0xFD MODF;   /* SPI 0 MODE FAULT FLAG                         */
sbit at 0xFE WCOL;   /* SPI 0 WRITE COLLISION FLAG                    */
sbit at 0xFF SPIF;   /* SPI 0 INTERRUPT FLAG                          */

/*  P7  0xF8 */
sbit at 0xF8 P7_0;
sbit at 0xF9 P7_1;
sbit at 0xFA P7_2;
sbit at 0xFB P7_3;
sbit at 0xFC P7_4;
sbit at 0xFD P7_5;
sbit at 0xFE P7_6;
sbit at 0xFF P7_7;


/* Predefined SFR Bit Masks */

#define IDLE     0x01             /* PCON                                */
#define STOP     0x02             /* PCON                                */
#define ECCF     0x01             /* PCA0CPMn                            */
#define PWM      0x02             /* PCA0CPMn                            */
#define TOG      0x04             /* PCA0CPMn                            */
#define MAT      0x08             /* PCA0CPMn                            */
#define CAPN     0x10             /* PCA0CPMn                            */
#define CAPP     0x20             /* PCA0CPMn                            */
#define ECOM     0x40             /* PCA0CPMn                            */
#define PWM16    0x80             /* PCA0CPMn                            */
#define PORSF    0x02             /* RSTSRC                              */
#define SWRSF    0x10             /* RSTSRC                              */


/* SFR PAGE DEFINITIONS */

#define CONFIG_PAGE     0x0F       /* SYSTEM AND PORT CONFIGURATION PAGE */
#define LEGACY_PAGE     0x00       /* LEGACY SFR PAGE                    */
#define TIMER01_PAGE    0x00       /* TIMER 0 AND TIMER 1                */
#define CPT0_PAGE       0x01       /* COMPARATOR 0                       */
#define CPT1_PAGE       0x02       /* COMPARATOR 1                       */
#define UART0_PAGE      0x00       /* UART 0                             */
#define UART1_PAGE      0x01       /* UART 1                             */
#define SPI0_PAGE       0x00       /* SPI 0                              */
#define EMI0_PAGE       0x00       /* EXTERNAL MEMORY INTERFACE          */
#define ADC0_PAGE       0x00       /* ADC 0                              */
#define ADC2_PAGE       0x02       /* ADC 2                              */
#define SMB0_PAGE       0x00       /* SMBUS 0                            */
#define TMR2_PAGE       0x00       /* TIMER 2                            */
#define TMR3_PAGE       0x01       /* TIMER 3                            */
#define TMR4_PAGE       0x02       /* TIMER 4                            */
#define DAC0_PAGE       0x00       /* DAC 0                              */
#define DAC1_PAGE       0x01       /* DAC 1                              */
#define PCA0_PAGE       0x00       /* PCA 0                              */
#define PLL0_PAGE       0x0F       /* PLL 0                              */

#endif /* ifndef C8051F120_H */
